shunohearthstone-hash/newproject/sdkconfig.defaults
# ESP32-S3 Target
CONFIG_IDF_TARGET="esp32s3"

# Build mode: Transport (raw complex FFT for host IFFT)
CONFIG_FFT_BUILD_TRANSPORT=y
# CONFIG_FFT_BUILD_DISPLAY is not set

# ADC/FFT settings
CONFIG_ADC_FS=44100
CONFIG_ADC_FFT_SIZE=2048
CONFIG_ADC_CH0=0
CONFIG_ADC_CH1=1
CONFIG_ADC_ATTEN_DB_11=y

# Transport mode: ALL modifiers MUST be OFF
# CONFIG_ADC_ENABLE_WINDOW is not set
# CONFIG_OUTPUT_TOPK_ENABLE is not set
# CONFIG_OUTPUT_CUTOFF_HZ is not set
# CONFIG_ADC_IIR_FILTER_ENABLE is not set

# USB CDC for data streaming
CONFIG_TINYUSB_CDC_ENABLED=y
CONFIG_TINYUSB_CDC_RX_BUFSIZE=2048
CONFIG_TINYUSB_CDC_TX_BUFSIZE=16384

# Status LED
CONFIG_STATUS_NEOPIXEL_ENABLE=y
CONFIG_STATUS_NEOPIXEL_GPIO=48
CONFIG_STATUS_NEOPIXEL_BRIGHTNESS=32

# Disable Wi-Fi to avoid ADC interference
# CONFIG_ESP_WIFI_ENABLED is not set
# CDC diagnostics (disabled by default)
# CONFIG_DIAG_CDC_ENABLE is not set
CONFIG_DIAG_CDC_LOG_INTERVAL_S=5
CONFIG_DIAG_CDC_SAMPLE_WRITE_AVAILABLE=y
# Wave generator disabled by default
# CONFIG_ENABLE_I2S_WAVE_GEN is not set
# CONFIG_ENABLE_SDM_WAVE_GEN is not set
# ESP PSRAM
#
CONFIG_SPIRAM=y

#
# SPI RAM config
#
# CONFIG_SPIRAM_MODE_QUAD is not set
CONFIG_SPIRAM_MODE_OCT=y
# default:
CONFIG_SPIRAM_TYPE_AUTO=y
# flash
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y